In [27]:
# 7-1 누락된 데이터 (= 결측값) 골라내기
import pandas as pd
import numpy as np
string_Data = pd.Series(["a","b","c",np.nan,"d"])
string_Data # 1차원에 시리즈로 데이터가 출력됨을 볼수 있고 3행에 해당하는 데이터를 NA값을 가졌음도 확인

0      a
1      b
2      c
3    NaN
4      d
dtype: object

In [6]:
string_Data.isnull() # NA값 존재 여부를 존재하면 True 없으면 False로 해석가능

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [7]:
#.dropna() Series에 적용하면 NA가 아닌 데이터와 색인값만 들어있는 Series를 출력한다.

In [10]:
from numpy import nan as NA # numpy 라이브러리에서 nan 메서드를 가져오는데 줄여서 NA로 할게 
data = pd.DataFrame([ [1,6.5,3] , [1, NA, NA] , [NA,NA,NA] , [NA,6.5,3]])
data # 4행 3열의 데이터프레임을 볼 수 있음

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data.dropna() # NA가 하나라도 포함되어 있으면 무조건 제외시키기 때문에 "0행"만 추출함을 볼 수 있음

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how="all") # 모두 NA인 행만 제외시킨다.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data.dropna(how="all", axis = 1) # axis = 1을 주면 기존에 row 였던 기준이 columns로 바뀌면서
                                 # column 내에 모두 NA값이 아닌 녀석들이기 없기 때문에 데이터 변화 없이 모두 추출됬음을 볼 수 있다.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [26]:
# dropna(thresh=2) 2개 이상의 na면 제거한다 (thresh=1은 적용이 안되는 것 같음)
data.dropna(thresh = 2)

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

In [33]:
# 7-2 결측치 채우기 .fillna(n) na값을 n으로 채워 넣음.
data.fillna(0)

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

In [36]:
data.fillna({0:2, 1:0.5, 2:0}) # 딕셔너리를 줘서 각 columns에 다른 값을 부여할 수 있음.

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.5  0.0
2  2.0  0.5  0.0
3  2.0  6.5  3.0

In [39]:
data #fillna(n)은 원본 데이터 수정이 아닌 복사본을 만드는 행위임.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [42]:
data.fillna({0:2, 1:0.5, 2:0}, inplace = True) #fillna(n, inplace = True)는 원본 데이터 자체 내용을 바꾸는 행위임.
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.5  0.0
2  2.0  0.5  0.0
3  2.0  6.5  3.0